driver-tests/sqlse/db2/SqlSE1201_DB2/SelectAllRowsTableJbi/src/jbiServiceUnits/SelectAllRowsTableBpel/SelectAllRowsTableWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL" name="SelectAllRowsTableWSDL" xmlns:ns="http://j2ee.netbeans.org/xsd/tableSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:jdbc="http://schemas.sun.com/jbi/wsdl-extensions/jdbc/">
    <wsdl:types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL">
            <xsd:import namespace="http://j2ee.netbeans.org/xsd/tableSchema" schemaLocation="DRIVERTEST_EMP.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="SelectAllRowsTableWSDLOperationRequest">
        <wsdl:part name="part1" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="SelectAllRowsTableWSDLOperationReply">
        <wsdl:part name="part1" element="ns:DRIVERTEST_EMP"/>
    </wsdl:message>
    <wsdl:portType name="SelectAllRowsTableWSDLPortType">
        <wsdl:operation name="SelectAllRowsTableWSDLOperation">
            <wsdl:input name="input1" message="tns:SelectAllRowsTableWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:SelectAllRowsTableWSDLOperationReply"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="SelectAllRowsTableWSDLBinding" type="tns:SelectAllRowsTableWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="SelectAllRowsTableWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SelectAllRowsTableWSDLService">
        <wsdl:port name="SelectAllRowsTableWSDLPort" binding="tns:SelectAllRowsTableWSDLBinding">
            <soap:address location="http://localhost:18181/SelectAllRowsTableWSDLService/SelectAllRowsTableWSDLPort"/>
        </wsdl:port>
    </wsdl:service>
    <plnk:partnerLinkType name="SelectAllRowsTableWSDLPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SelectAllRowsTableWSDLPortTypeRole" portType="tns:SelectAllRowsTableWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
