driver-tests/sqlse/db2/SqlSE1201_DB2/SelectAllRowsTableJbi/test/SqlSE1201_DB2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://j2ee.netbeans.org/wsdl/SelectAllRowsTableWSDL">
  <soapenv:Body>
    <sel:SelectAllRowsTableWSDLOperation>
      <part1>HelloWorld!</part1>
    </sel:SelectAllRowsTableWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>